Microchip-MPLAB-Harmony/dev_packs/Microchip/PIC32CK-SG_DFP/1.0.10/PIC32CK-SG01/gcc/gcc/startup_pic32ck2051sg01100.c
/**
 * \file
 *
 * \brief GCC startup file for PIC32CK2051SG01100
 *
 * Copyright (c) 2022 Microchip Technology Inc.
 *
 * \license_start
 *
 * \page License
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * Licensed under the Apache License, Version 2.0 (the "License");
 * you may not use this file except in compliance with the License.
 * You may obtain a copy of the License at
 *
 *   http://www.apache.org/licenses/LICENSE-2.0
 *
 * Unless required by applicable law or agreed to in writing, software
 * distributed under the License is distributed on an "AS IS" BASIS,
 * WITHOUT WARRANTIES OR CONDITIONS OF ANY KIND, either express or implied.
 * See the License for the specific language governing permissions and
 * limitations under the License.
 *
 * \license_stop
 *
 */

#include "pic32ck2051sg01100.h"

/* Initialize segments */
extern uint32_t _sfixed;
extern uint32_t _efixed;
extern uint32_t _etext;
extern uint32_t _srelocate;
extern uint32_t _erelocate;
extern uint32_t _szero;
extern uint32_t _ezero;
extern uint32_t _sstack;
extern uint32_t _estack;

/* Optional application-provided functions */
extern void __attribute__((weak,long_call)) _on_reset(void);
extern void __attribute__((weak,long_call)) _on_bootstrap(void);

/** \cond DOXYGEN_SHOULD_SKIP_THIS */
int main(void);
/** \endcond */

void __libc_init_array(void);

/* Reset handler */
void Reset_Handler(void);

/* Default empty handler */
void Dummy_Handler(void);

/* Cortex-M33 core handlers */
void NonMaskableInt_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HardFault_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MemoryManagement_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void BusFault_Handler     ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void UsageFault_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SecureFaultMonitor_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SVCall_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DebugMonitor_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PendSV_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SysTick_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Peripherals handlers */
void FCR_ERR_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FCR_FLT_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FCW_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PM_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SUPC_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_XOSC_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_DFLL_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSCCTRL_PLL0_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void OSC32KCTRL_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void MCLK_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void FREQM_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void WDT_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void RTC_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_0_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_1_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_2_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_3_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_4_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_5_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_6_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_7_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_8_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_9_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_10_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_11_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_12_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_13_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_14_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_EXTINT_15_Handler ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EIC_NSCHK_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PAC_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TRAM_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PORT_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA0_PRI0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA0_PRI1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA0_PRI2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA1_PRI0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void DMA1_PRI1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HMATRIX_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_0_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_1_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_2_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_3_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void EVSYS_OTHER_Handler  ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM0_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM1_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM2_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM3_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC0_MC_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC1_MC_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC2_MC_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC3_MC_5_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM4_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM5_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM6_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_56_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_2_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_3_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SERCOM7_4_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC4_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC5_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC6_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_OTHER_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_MC_0_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TCC7_MC_1_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_0_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_1_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_2_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_3_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_4_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ADC_5_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void AC_Handler           ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PTC_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SPI_IXS_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PCC_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void PDEC_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN0_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void CAN1_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void ETH_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SQI_Handler          ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void TRNG_Handler         ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SDMMC0_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void SDMMC1_Handler       ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USB_OTHER_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USB_SOF_Handler      ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USB_TRCPT0_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USB_TRCPT1_Handler   ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void USBHS_Handler        ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HSM_ERROR_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HSM_TXINT_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));
void HSM_RXINT_Handler    ( void ) __attribute__ ((weak, alias("Dummy_Handler")));

/* Exception Table */
__attribute__ ((section(".vectors")))
const DeviceVectors exception_table = {

        /* Configure Initial Stack Pointer, using linker-generated symbols */
        .pvStack = (void*) (&_estack),

        .pfnReset_Handler              = (void*) Reset_Handler,
        .pfnNonMaskableInt_Handler     = (void*) NonMaskableInt_Handler,
        .pfnHardFault_Handler          = (void*) HardFault_Handler,
        .pfnMemoryManagement_Handler   = (void*) MemoryManagement_Handler,
        .pfnBusFault_Handler           = (void*) BusFault_Handler,
        .pfnUsageFault_Handler         = (void*) UsageFault_Handler,
        .pfnSecureFaultMonitor_Handler = (void*) SecureFaultMonitor_Handler,
        .pvReservedC8                  = (void*) (0UL), /* Reserved */
        .pvReservedC7                  = (void*) (0UL), /* Reserved */
        .pvReservedC6                  = (void*) (0UL), /* Reserved */
        .pfnSVCall_Handler             = (void*) SVCall_Handler,
        .pfnDebugMonitor_Handler       = (void*) DebugMonitor_Handler,
        .pvReservedC3                  = (void*) (0UL), /* Reserved */
        .pfnPendSV_Handler             = (void*) PendSV_Handler,
        .pfnSysTick_Handler            = (void*) SysTick_Handler,

